personal/z-settings.org
* Overview
This is the custom part of my emacs config.
At the moment it's based on emacs-prelude, although I configure some parts differently.
For example, I have spaceline instead of smart-mode-line, and a custom company configuration.

Many things in here are inspired by Uncle Dave's emacs config, and a large amount of random
config snippets I found around the internet.

In the first section, I have general setup of UI or global modes such as line numbers, custom
keybinds, the mode line and more.

In the second section, there's major-mode specific settings for those modes that are important
to me.

* UI/global
** Darwin
Custom configuration for Mac OSX. I'm using Mitsuharu Yamamoto's emacs-mac,
which requires some different settings than what prelude provides.

Setup as follows:
- fn      --> Hyper
- Ctrl    --> Control
- Option  --> Meta
- Command --> Super

Settings outside of emacs (System menu and Karabiner Elements):
- Caps Lock --> Control
- Return    --> Control ([[http://emacsredux.com/blog/2017/12/31/a-crazy-productivity-boost-remapping-return-to-control-2017-edition/][see this article]])

#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin) ;; mac specific settings
    (setq mac-option-modifier 'meta)
    ;; (setq mac-right-option-modifier 'none)
    (setq mac-command-modifier 'super)
    (setq mac-function-modifier 'hyper)
    (global-set-key [kp-delete] 'delete-char)
    ;; For some reason lockfiles break python anaconda-mode's autocomplete
    (setq create-lockfiles nil))
#+END_SRC
** Windows
Special settings for Windows.
Similar to Mac, special keybinds are enabled:

- Ctrl        --> Control
- Alt         --> Meta
- Menu        --> Super

#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'windows-nt)
    ;; Performance
    (setq w32-pipe-read-delay 0)
    (setq w32-pipe-buffer-size (* 64 1024)) ;; 64k Buffer Size
    (setq jit-lock-defer-time 0)
    (setq inhibit-compacting-font-caches t)
    ;; Scrolling fixes
    (setq fast-but-imprecise-scrolling t)
    (pixel-scroll-mode 0)
    (setq scroll-conservatively 10000
          scroll-preserve-screen-position 1
          scroll-step 1
          scroll-bar-mode -1)
    (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
    (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
    (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
    ;; Font
    (set-face-attribute 'default nil :family "Meslo LG M" :height 90)
    ;; UTF-8 as default encoding
    (set-language-environment "UTF-8")

    ;; make PC keyboard's Win key or other to type Super or Hyper, for emacs running on Windows.
    (setq w32-pass-lwindow-to-system nil)
    (setq w32-lwindow-modifier 'super) ; Left Windows key

    (setq w32-pass-rwindow-to-system nil)
    (setq w32-rwindow-modifier 'super) ; Right Windows key

    (setq w32-pass-apps-to-system nil)
    (setq w32-apps-modifier 'super) ; Menu/App key
    )
#+END_SRC
** Performance
#+BEGIN_SRC emacs-lisp
  ;; Instead of setting gc-cons-threshold, use gcmh.
  (use-package gcmh
    :ensure t
    :init
    (setq gcmh-high-cons-threshold 50000000
          gcmh-verbose nil
          gcmh-idle-delay 15)
    :config
    (gcmh-mode 1))
#+END_SRC
** Dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-items '((recents  . 5)
                            (projects . 5)))
    (setq dashboard-banner-logo-title "")
    (add-to-list 'dashboard-items '(agenda) t))
#+END_SRC
** Projectile
To speed up indexing, use alien indexing with fd on all operating systems.
Also enable caching and set sort order to recent files.
#+BEGIN_SRC emacs-lisp
  (setq projectile-indexing-method 'alien
        projectile-generic-command "fd . -0 --no-ignore-vcs"
        projectile-git-command "fd . -0 --no-ignore-vcs"
        projectile-svn-command "fd . -0 --no-ignore-vcs"
        projectile-git-submodule-command nil
        projectile-sort-order 'recentf
        projectile-enable-caching t)
#+END_SRC
** Theme
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . dark))
#+END_SRC
** Scrolling
#+BEGIN_SRC emacs-lisp
  (scroll-bar-mode -1)

  (if (eq system-type 'windows-nt)
      (pixel-scroll-mode -1)
    (pixel-scroll-mode 1))

#+END_SRC
** Shortcuts / keybinds
*** iy-go-to-char
Use iy-go-to-char to jump around in the buffer.
#+BEGIN_SRC emacs-lisp
  (use-package iy-go-to-char
    :ensure t
    :config
    (key-chord-define-global "xf" 'iy-go-to-char)
    (key-chord-define-global "xd" 'iy-go-to-char-backward))
#+END_SRC
*** Hydra
#+BEGIN_SRC emacs-lisp
  (use-package hydra
    :ensure t)
#+END_SRC
*** switch-window
#+BEGIN_SRC emacs-lisp
  ;; TODO: move everything here into use-package
  (use-package switch-window
    :ensure t)
  ;; Override global key bindings for switching windows.
  (global-set-key (kbd "C-x o") 'switch-window)
  (global-set-key (kbd "C-x 1") 'switch-window-then-maximize)
  (global-set-key (kbd "C-x 2") 'switch-window-then-split-below)
  (global-set-key (kbd "C-x 3") 'switch-window-then-split-right)
  (global-set-key (kbd "C-x 0") 'switch-window-then-delete)

  (global-set-key (kbd "C-x 4 d") 'switch-window-then-dired)
  (global-set-key (kbd "C-x 4 f") 'switch-window-then-find-file)
  (global-set-key (kbd "C-x 4 m") 'switch-window-then-compose-mail)
  (global-set-key (kbd "C-x 4 r") 'switch-window-then-find-file-read-only)

  (global-set-key (kbd "C-x 4 C-f") 'switch-window-then-find-file)
  (global-set-key (kbd "C-x 4 C-o") 'switch-window-then-display-buffer)

  (global-set-key (kbd "C-x 4 0") 'switch-window-then-kill-buffer)

  ;; Use home row instead of number keys.
  (setq switch-window-input-style 'minibuffer)
  (setq switch-window-increase 6)
  (setq switch-window-threshold 2)
  (setq switch-window-shortcut-style 'qwerty)
  (setq switch-window-qwerty-shortcuts
        '("a" "s" "d" "f" "j" "k" "l" ";" "w" "e" "i" "o"))

  ;; Prelude also comes with ace-window, which uses custom keybinds (Super-w).
  ;; Set it to also use homerow keys instead of numbers for buffers.
  ;; TODO: decide which one I like better, e.g.
  ;; (Super-w v a) or (C-x 2 a) to split window a.

  (setq aw-keys '(?a ?s ?d ?f ?k ?l ?\; ?w ?e ?i))

  ;; Hydra keybinds for ace-window
  (global-set-key
   (kbd "C-M-o")
   (defhydra hydra-window (:color red
                                  :columns nil)
     "window"
     ("h" windmove-left nil)
     ("j" windmove-down nil)
     ("k" windmove-up nil)
     ("l" windmove-right nil)
     ("H" hydra-move-splitter-left nil)
     ("J" hydra-move-splitter-down nil)
     ("K" hydra-move-splitter-up nil)
     ("L" hydra-move-splitter-right nil)
     ("v" (lambda ()
            (interactive)
            (split-window-right)
            (windmove-right))
      "vert")
     ("x" (lambda ()
            (interactive)
            (split-window-below)
            (windmove-down))
      "horz")
     ("t" transpose-frame "'" :exit t)
     ("o" delete-other-windows "one" :exit t)
     ("a" ace-window "ace")
     ("s" ace-swap-window "swap")
     ("d" ace-delete-window "del")
     ("i" ace-maximize-window "ace-one" :exit t)
     ("b" ido-switch-buffer "buf")
     ("m" headlong-bookmark-jump "bmk")
     ("q" nil "cancel")
     ("u" (progn (winner-undo) (setq this-command 'winner-undo)) "undo")
     ("f" nil)))
#+END_SRC
*** multiple-cursors
#+BEGIN_SRC emacs-lisp
  ;; Multiple cursors
  (use-package multiple-cursors
    :ensure t
    :demand t
    :bind
    (("C-S-c C-S-c" . mc/edit-lines)
     ;; If nothing is selected, pick the symbol under the cursor.
     ("C->" . mc/mark-next-like-this-symbol)
     ("C-<" . mc/mark-previous-like-this-symbol)
     ("C-c C-<" . mc/mark-all-like-this)
     ("H-SPC" . set-rectangular-region-anchor)
     ;; Special commands for inserting numbers or chars, sorting and reversing.
     ("C-c x n" . mc/insert-numbers)
     ("C-c x l" . mc/insert-letters)
     ("C-c x s" . mc/sort-regions)
     ("C-c x r" . mc/reverse-regions)))
#+END_SRC
*** kill-word
Adapted from Uncle Dave's emacs config.
#+BEGIN_SRC emacs-lisp
  (defun daedreth/kill-inner-word ()
    "Kills the entire word your cursor is in. Equivalent to 'ciw' in vim."
    (interactive)
    (forward-char 1)
    (backward-word)
    (kill-word 1))
  (global-set-key (kbd "C-c x w") 'daedreth/kill-inner-word)
#+END_SRC
*** copy-whole-line
#+BEGIN_SRC emacs-lisp
  ;; Another one of Uncle Dave's functions to copy a while line.
  (defun daedreth/copy-whole-line ()
    "Copies a line without regard for cursor position."
    (interactive)
    (save-excursion
      (kill-new
       (buffer-substring
        (point-at-bol)
        (point-at-eol)))))
  (global-set-key (kbd "C-c x c") 'daedreth/copy-whole-line)
#+END_SRC
*** All over the screen
Deletes all other windows, then creates multiple windows and uses follow mode to display file "all over the screen".
Courtesy of Kragen Javier Sitaker on Stackoverflow.
#+BEGIN_SRC emacs-lisp
  (defun all-over-the-screen ()
    (interactive)
    (delete-other-windows)
    (split-window-horizontally)
    (split-window-horizontally)
    (balance-windows)
    (follow-mode t))

  (global-set-key (kbd "C-c x a") 'all-over-the-screen)
#+END_SRC
