personal/z-settings.el

;; Custom shortcut to open this file.
(defun config-visit ()
  (interactive)
  (find-file "~/.emacs.d/personal/z-settings.org"))

(global-set-key (kbd "C-c v c") 'config-visit)

;; Reload config file
(defun config-reload ()
  (interactive)
  (org-babel-load-file "~/.emacs.d/personal/z-settings.org"))

(global-set-key (kbd "C-c v r") 'config-reload)

;; Visit package list
(defun visit-package-list-buffer ()
  (interactive)
  (crux-start-or-switch-to (lambda ()
                             (package-list-packages))
                           "*Packages*"))

(global-set-key (kbd "C-c v p") 'visit-package-list-buffer)

(defun xref-pop-recenter ()
  "Like xref-pop-marker-stack, but recenters the screen around the cursor after jumping to the position."
  (interactive)
  (xref-pop-marker-stack)
  (recenter-top-bottom))

(global-set-key (kbd "M-,") 'xref-pop-recenter)

;; Bind avy-copy-line. Uses x d because it actually duplicates a line.
(global-set-key (kbd "C-c x d") 'avy-copy-line)

;; Currently disabed because it doesn't work with mood-line
  ;; (use-package nyan-mode
  ;;   :ensure t
  ;;   :config
  ;;   (setq nyan-animate-nyancat t
  ;;         nyan-wavy-trail t
  ;;         nyan-bar-length 13))

  ;; (nyan-mode 1)

;; (use-package spaceline
;;   :ensure t
;;   :config
;;   (require 'spaceline-config)
;;   (setq spaceline-buffer-encoding-abbrev-p nil)
;;   (setq spaceline-line-column-p nil)
;;   (setq spaceline-line-p nil)
;;   (setq powerline-default-separator (quote arrow))
;;   (spaceline-emacs-theme))

(use-package mood-line
  :ensure t
  :config)

(mood-line-mode)

(setq display-time-24hr-format t)
(setq display-time-format " %H:%M ")
(setq display-time-default-load-average nil)
(display-battery-mode 0)

(display-time-mode 1)

(use-package fancy-battery
  :ensure t
  :config
  (setq fancy-battery-show-percentage t)
  (setq battery-update-interval 15)
  (if window-system
      (fancy-battery-mode)
    (display-battery-mode)))

(setq line-number-mode t)
(setq column-number-mode t)

(use-package company
  :bind
  (:map company-active-map
        ("M-n" . nil)
        ("M-p" . nil)
        ("C-n" . company-select-next)
        ("C-p" . company-select-previous)
        ("<return>" . nil)
        ("RET" . nil)
        ("<tab>" . company-complete-selection))
  :hook
  (prog-mode . company-mode)
  :ensure t
  :config
  (setq company-minimum-prefix-length 3)
  (setq company-idle-delay 0.4)
  (setq company-tooltip-limit 15)
  (setq company-backends (delete 'company-semantic company-backends))
  (setq company-tooltip-align-annotations t)
  (setq company-tooltip-flip-when-above t)
  (add-to-list 'company-backends 'company-dabbrev))

;; (add-to-list 'company-backends 'company-dabbrev-code)
;; (add-to-list 'company-backends 'company-yasnippet)
;; (add-to-list 'company-backends 'company-files)

(global-display-line-numbers-mode)

;; Enable mode, and whitespace cleanup on save.
(setq prelude-whitespace t)
(setq prelude-clean-whitespace-on-save t)

;; Mark lines exceeding 120 columns.
(setq whitespace-line-column 120)
;; Set whitespace style: cleanup empty lines / trailing whitespace, show whitespace characters.
(setq whitespace-style '(empty trailing face lines-tail indentation::space tabs newline tab-mark newline-mark))
;; Use spaces instead of tabs by default.
(setq-default indent-tabs-mode nil)

;; dotenv-mode
(use-package dotenv-mode
  :ensure t)

;; Also apply to .env with extension such as .env.local
(add-to-list 'auto-mode-alist '("\\.env\\..*\\'" . dotenv-mode))

;; Use swiper for search.
(use-package swiper
  :ensure t)

;; Swiper do-what-I-mean
;; When text is marked, search for that.
;; When nothing is marked, search for input.
(defun swiper-dwim ()
  "Use current region if active for swiper search"
  (interactive)
  (if (not (use-region-p))
      (swiper)
    (deactivate-mark)
    (swiper (format "%s" (buffer-substring (region-beginning) (region-end))))))

(global-set-key (kbd "C-s") 'swiper-dwim)

(with-eval-after-load 'helm
  ;; Use tab to expand stuff in helm. (Sorry)
  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-z") 'helm-select-action)
  (global-set-key (kbd "C-h SPC") 'helm-all-mark-rings)
  (bind-key* "C-r" 'helm-resume)
  ;; Fuzzy matching everywhere
  (setq
   helm-candidate-number-limit 50
   helm-mode-fuzzy-match t
   helm-completion-in-region-fuzzy-match t
   helm-buffers-fuzzy-matching t
   helm-imenu-fuzzy-match t
   helm-recentf-fuzzy-match t
   helm-locate-fuzzy-match nil
   helm-M-x-fuzzy-match t
   helm-semantic-fuzzy-match t

   helm-case-fold-search 'smart
   helm-ff-transformer-show-only-basename nil
   helm-ff-newfile-prompt-p nil

   ;; Autoresize helm buffer depending on match count
   helm-autoresize-max-height 0
   helm-autoresize-min-height 40))

(helm-autoresize-mode 1)

;; Use git grep for helm.
(setq projectile-use-git-grep 1)

;; Additional Helm-related packages
(use-package helm-flx
  :ensure t
  :config
  (helm-flx-mode +1)
  (setq helm-flx-for-helm-find-files t ;; t by default
        helm-flx-for-helm-locate t) ;; nil by default
  )
(setq helm-ag-base-command "ag -U --vimgrep")

(use-package dot-mode
  :ensure t
  :config
  (global-dot-mode 1))

(use-package rainbow-delimiters
  :ensure t
  :hook
  (prog-mode . rainbow-delimiters-mode))

;; Not yet working!!
;; (use-package rainbow-csv
;;   :load-path "~/projects/rainbow-csv/"
;;   :init
;;   (add-hook 'csv-mode-hook #'rainbow-csv-mode))

(when window-system
  (use-package pretty-mode
    :ensure t
    :after
    (global-pretty-mode t)))

(global-prettify-symbols-mode +1)

(use-package yasnippet
  :ensure t
  :config
  (add-to-list 'yas-snippet-dirs "~/.emacs.d/personal/snippets")
  (use-package yasnippet-snippets
    :ensure t)
  (add-to-list 'yas-snippet-dirs "~/.emacs.d/personal/snippets" t)
  (yas-reload-all))

(use-package auto-yasnippet
  :ensure t
  :after yasnippet
  :bind
  ("C-o" . aya-open-line)
  :config
  (setq aya-persist-snippets-dir "~/.emacs.d/personal/snippets"))

(add-hook 'prog-mode-hook 'yas-minor-mode)
(add-hook 'latex-mode-hook 'yas-minor-mode)
(add-hook 'org-mode-hook 'yas-minor-mode)

;; Adapted from abo-abo/function-args
(defun moo-javadoc ()
  "Generate a javadoc yasnippet and expand it with `aya-expand'.
The point should be inside the method to generate docs for"
  (interactive)
  (move-beginning-of-line nil)
  (let ((tag (semantic-current-tag)))
    (unless (semantic-tag-of-class-p tag 'function)
      (error "Expected function, got %S" tag))
    (let* ((name (semantic-tag-name tag))
           (attrs (semantic-tag-attributes tag))
           (args (plist-get attrs :arguments))
           (ord 1))
      (setq aya-current
            (format
             "/**
* $1
*
%s
* @return $%d
*/"
             (mapconcat
              (lambda (x)
                (format "* @param %s $%d"
                        (car x) (incf ord)))
              args
              "\n")
             (incf ord)))
      (senator-previous-tag)
      (crux-smart-open-line-above)
      (aya-expand))))

(defun cc-end-line-with-semicolon ()
  (interactive)
  (move-end-of-line nil)
  (insert-char ?\; 1)
  (crux-smart-open-line nil))
