personal/z-settings.el

(use-package magit
  :ensure t
  :defer t
  ;; :hook
  ;; (after-save . magit-after-save-refresh-status)
  :config
  (define-key magit-status-mode-map (kbd "Q") 'magit-toggle-whitespace))

(use-package forge
  :ensure t
  :after magit)

(defun magit-toggle-whitespace ()
  (interactive)
  (if (member "-w" magit-diff-options)
      (magit-dont-ignore-whitespace)
    (magit-ignore-whitespace)))

(defun magit-ignore-whitespace ()
  (interactive)
  (add-to-list 'magit-diff-options "-w")
  (magit-refresh))

(defun magit-dont-ignore-whitespace ()
  (interactive)
  (setq magit-diff-options (remove "-w" magit-diff-options))
  (magit-refresh))

(use-package vimish-fold
  :ensure t
  :config (add-hook 'prog-mode-hook 'vimish-fold-mode))

(bind-key "s-a" (defhydra hydra-vimish-fold
                  (:color blue
                          :columns 3)
                  "fold"
                  ("a" vimish-fold-avy "avy")
                  ("d" vimish-fold-delete "del")
                  ("D" vimish-fold-delete-all "del-all")
                  ("u" vimish-fold-unfold "undo")
                  ("U" vimish-fold-unfold-all "undo-all")
                  ("s" vimish-fold "fold")
                  ("r" vimish-fold-refold "refold")
                  ("R" vimish-fold-refold-all "refold-all")
                  ("t" vimish-fold-toggle "toggle" :exit nil)
                  ("T" vimish-fold-toggle-all "toggle-all" :exit nil)
                  ("j" vimish-fold-next-fold "down" :exit nil)
                  ("k" vimish-fold-previous-fold "up" :exit nil)
                  ("q" nil "quit")))

;; (use-package hideshow-org
;;   :ensure t
;;   :config
;;   ()
;;   (add-hook 'prog-mode-hook 'hs-org/minor-mode))

(with-eval-after-load 'god-mode
  (define-key god-local-mode-map (kbd "i") 'god-local-mode)
  (define-key god-local-mode-map (kbd ".") 'repeat))

(use-package sx
  :ensure t
  :config
  (bind-keys :prefix "C-c q"
             :prefix-map my-sx-map
             :prefix-docstring "Global keymap for SX."
             ("q" . sx-tab-all-questions)
             ("i" . sx-inbox)
             ("o" . sx-open-link)
             ("u" . sx-tab-unanswered-my-tags)
             ("a" . sx-ask)
             ("s" . sx-search)))

(use-package nhexl-mode
  :ensure t
  :defer t)

;;;; This is currently disabled because of a compilation error in pdf-tools.
;; (use-package pdf-tools
;;   :ensure t
;;   :config
;;   (custom-set-variables
;;    '(pdf-tools-handle-upgrades nil)) ; Use brew upgrade pdf-tools instead.
;;   (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo"))
;; (pdf-tools-install)

(use-package outshine
  :defer t
  :ensure t
  :hook
  ((emacs-lisp-mode . outshine-mode)
   (LaTeX-mode . outshine-mode)
   (picolisp-mode . outshine-mode)
   (clojure-mode . outshine-mode)
   (ess-mode . outshine-mode)
   (ledger-mode . outshine-mode)
   (python-mode . outshine-mode)))

(use-package treemacs
  :ensure t
  :config
  (setq treemacs-width 50
        treemacs-indentation 2))

;; Global semantic mode
(semantic-mode 1)
(global-semantic-highlight-func-mode 1)

;; Enable subword-mode for all programming modes
(add-hook 'prog-mode-hook 'subword-mode)

;; I never got smartparens to work properly with cc-mode (formatting etc). So I use the builtins instead, which work nicely.
(defun disable-smartparens ()
  (smartparens-mode 0)
  (electric-pair-mode 1))

(add-hook 'c-mode-common-hook 'disable-smartparens)

;; String-edit: Edit strings in separate buffer to avoid escape nightmares
(use-package string-edit
  :ensure t
  :bind
  (:map c-mode-base-map
        ("C-c '" . string-edit-at-point)))

;; Unfill - opposite to M-q (fill-paragraph)
(use-package unfill
  :ensure t
  :bind ([remap fill-paragraph] . unfill-toggle))

;; Source: https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org
(defun me/eval-region-and-kill-mark (beg end)
  "Execute the region as Lisp code.
    Call `eval-region' and kill mark. Move back to the beginning of the region."
  (interactive "r")
  (eval-region beg end)
  (setq deactivate-mark t)
  (goto-char beg))

(global-set-key (kbd "C-:") 'me/eval-region-and-kill-mark)
(global-set-key (kbd "M-n") 'move-text-down)
(global-set-key (kbd "M-p") 'move-text-up)

;; https://www.masteringemacs.org/article/fixing-mark-commands-transient-mark-mode
(defun push-mark-no-activate ()
  "Pushes `point' to `mark-ring' and does not activate the region
   Equivalent to \\[set-mark-command] when \\[transient-mark-mode] is disabled"
  (interactive)
  (push-mark (point) t nil)
  (message "Pushed mark to ring"))

(global-set-key (kbd "C-`") 'push-mark-no-activate)

(defun jump-to-mark ()
  "Jumps to the local mark, respecting the `mark-ring' order.
  This is the same as using \\[set-mark-command] with the prefix argument."
  (interactive)
  (set-mark-command 1))

(global-set-key (kbd "M-`") 'jump-to-mark)

(defun exchange-point-and-mark-no-activate ()
  "Identical to \\[exchange-point-and-mark] but will not activate the region."
  (interactive)
  (exchange-point-and-mark)
  (deactivate-mark nil))

(define-key global-map [remap exchange-point-and-mark] 'exchange-point-and-mark-no-activate)

(use-package helm-lsp
  :ensure t
  :commands helm-lsp-workspace-symbol)

(use-package lsp-mode
  :ensure t
  :hook
  ((c++-mode
    c-mode
    objc-mode
    java-mode) . lsp)
  :bind
  (:map lsp-mode-map
        ("C-;" . cc-end-line-with-semicolon)
        ("C-c l j" . moo-javadoc)
        ("C-c l o" . lsp-organize-imports)
        ("C-c l r" . lsp-rename)
        ("C-c l x" . lsp-restart-workspace)
        ("C-c l d" . lsp-describe-thing-at-point)
        ("C-c l h" . lsp-treemacs-call-hierarchy))
  :init
  (setq
   lsp-keymap-prefix "C-c l"
   lsp-eldoc-render-all nil
   lsp-enable-on-type-formatting nil
   lsp-enable-indentation nil
   lsp-enable-file-watchers nil
   lsp-enable-folding nil
   lsp-enable-text-document-color nil
   lsp-enable-semantic-highlighting nil
   lsp-enable-links nil
   lsp-signature-auto-activate nil
   lsp-prefer-capf t)
  :config
  (setq-local read-process-output-max (* 1024 1024))
  (setq-local gcmh-high-cons-threshold (* 2 gcmh-high-cons-threshold)))

(use-package lsp-ui
  :ensure t
  :after lsp-mode
  :demand t
  :hook
  ((c++-mode
    c-mode
    objc-mode
    python-mode
    java-mode) . lsp-ui-mode)
  :bind
  (:map lsp-ui-mode-map
        ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
        ([remap xref-find-references]  . lsp-ui-peek-find-references)
        ("C-c l ." . lsp-ui-peek-find-definitions)
        ("C-c l ?" . lsp-ui-peek-find-references)
        ("C-c l w" . lsp-ui-peek-find-workspace-symbol)
        ("C-c l i" . lsp-ui-peek-find-implementation)
        ("M-#"     . lsp-ui-doc-show)
        ("C-c l m" . lsp-ui-imenu))
  :config
  (setq lsp-ui-sideline-enable nil
        lsp-ui-sideline-update-mode 'line
        lsp-ui-peek-enable nil
        lsp-ui-peek-always-show nil
        lsp-ui-doc-enable nil))

(use-package dap-mode
  :ensure t
  :after lsp-mode
  :demand t
  :config
  (dap-mode t)
  (dap-ui-mode t))
