personal/z-settings.org
** C/C++
#+BEGIN_SRC emacs-lisp
  ;; Some C/C++ settings
  (require 'lsp-mode)
  (require 'lsp-clients)
  (use-package clang-format
    :ensure t)

  (defun clang-format-save-hook-for-this-buffer ()
    "Create a buffer local save hook."
    (add-hook 'before-save-hook
              (lambda ()
                (progn
                  (when (locate-dominating-file "." ".clang-format")
                    (clang-format-buffer))
                  ;; Continue to save.
                  nil))
              nil
              ;; Buffer local hook.
              t))

  ;; (setq lsp-clients-clangd-executable "c:/Program Files/LLVM/bin/clangd.exe")

  (add-hook 'c++-mode-hook 'lsp)

  (use-package ccls
    :ensure t
    :hook ((c-mode c++-mode objc-mode) .
           (lambda () (require 'ccls) (lsp))))
  (setq ccls-executable "c:/prj/ccls/Release/ccls.exe")
  (setq lsp-prefer-flymake nil)
  (setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc))
  (setq ccls-args '("--log-file=c:/prj/ccls/ccls.log"))

  ;; Use clang for formatting and flycheck in C/C++.
  (use-package flycheck-clang-analyzer
    :ensure t
    :after flycheck
    :config (flycheck-clang-analyzer-setup))

  (global-set-key (kbd "C-c x f") 'clang-format-region)
  (global-set-key (kbd "C-c x F") 'clang-format-buffer)

  (setq-default c-default-style "bsd")

  (add-hook 'c-mode-common-hook '(lambda () (c-toggle-hungry-state 1) (c-toggle-auto-newline 1) (c-set-style "bsd")))
#+END_SRC
** Python
#+BEGIN_SRC emacs-lisp
  ;; yasnippet
  (add-hook 'python-mode-hook 'yas-minor-mode)

  (use-package lsp-python-ms
    :ensure t
    :init (setq lsp-python-ms-auto-install-server t)
    :hook (python-mode . (lambda ()
                           (setq-default tab-width 4)
                           (require 'lsp-python-ms)
                           (lsp))))

  ;; virtualenvwrapper
  (use-package virtualenvwrapper
    :hook python-mode
    :ensure t
    :demand t
    :config
    ;; virtualenvwrapper init for eshell and interactive shell.
    (venv-initialize-interactive-shells) ;; if you want interactive shell support
    (venv-initialize-eshell) ;; if you want eshell support
    (setq projectile-switch-project-action
          '(lambda()
             (venv-projectile-auto-workon)
             (projectile-find-file))))

  ;; py-isort
  (use-package py-isort
    :defer t
    :hook
    (python-mode . (lambda () (add-hook 'before-save-hook 'py-isort-before-save)))
    :ensure t)

  ;; yapf
  (use-package yapfify
    :defer t
    :ensure t
    :hook
    (python-mode . yapf-mode))
#+END_SRC
** Org
Basic settings (lifted again from Uncle Dave).
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-confirm-babel-evaluate nil
        org-export-with-smart-quotes t)
  (add-hook 'org-mode-hook 'org-indent-mode)
#+END_SRC

Snippet for writing elisp like everywhere around this file.
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
#+END_SRC

Convert a buffer and associated decorations to HTML.
#+BEGIN_SRC emacs-lisp
  (use-package htmlize
    :ensure t)
#+END_SRC

** CPerl
#+BEGIN_SRC emacs-lisp
  (defalias 'perl-mode 'cperl-mode)

  (defun c-set-cperl-style ()
    (interactive)
    ;; Indentation
    (setq cperl-indent-level 4)
    (setq cperl-indent-parens-as-block t)
    (setq cperl-continued-statement-offset 4)
    (setq cperl-brace-offset -4)
    (setq cperl-close-paren-offset -4)
    (setq cperl-extra-newline-before-brace t)
    (setq cperl-merge-trailing-else nil)
    (setq cperl-tab-always-indent t)
    ;; Use font lock but disable invalid face
    (setq cperl-font-lock t)
    (setq cperl-invalid-face nil)
    ;; Auto-newline and electric parens
    (setq cperl-auto-newline t)
    (setq cperl-electric-parens nil))

  (add-hook 'cperl-mode-hook '(lambda ()
                                (disable-smartparens)
                                (c-set-cperl-style)
                                (c-toggle-hungry-state 1)
                                (c-toggle-auto-newline 1)))
#+END_SRC
** Java
#+BEGIN_SRC emacs-lisp
  (use-package lsp-java
    :ensure t
    :demand t
    :config
    (setq lsp-java-format-enabled nil
          lsp-java-signature-help-enabled nil
          lsp-java-completion-overwrite t
          lsp-java-autobuild-enabled nil))

  (add-hook 'java-mode-hook '(lambda () (c-set-java-style)))

  (defun c-set-java-style ()
    (interactive)
    (c-set-style "bsd")
    (setq c-default-style "bsd")
    (setq indent-tabs-mode t)
    (setq tab-width 4)
    (setq c-basic-offset 4)
    (add-to-list 'c-hanging-braces-alist '(substatement-open before after)))
#+END_SRC
* Overrides
#+BEGIN_SRC emacs-lisp
  (load "~/.emacs.d/personal/zz-overrides")
#+END_SRC
